app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if params[:artist_id] and !Artist.exists?(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 2]]
---
  def edit
    if params[:artist_id]
      @nest = true
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Hello"], ["updated_at", "2016-08-17 21:07:52.637051"], ["id", 2]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)